```
 $ tofu plan -out=plan
digitalocean_spaces_bucket.drupal: Refreshing state... [id=drupal]
aws_dynamodb_table.terraform_state_locks: Refreshing state... [id=terraform-state-locks]
aws_s3_bucket.terraform_state: Refreshing state... [id=gpo-terraform-state]
module.default_github_labels_for_readme.github_issue_label.enhancement: Refreshing state... [id=readme:enhancement]
module.default_github_labels_for_readme.github_issue_label.question: Refreshing state... [id=readme:question]
module.default_github_labels_for_readme.github_issue_label.good_first_issue: Refreshing state... [id=readme:good first issue]
module.default_github_labels_for_readme.github_issue_label.duplicate: Refreshing state... [id=readme:duplicate]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.duplicate: Refreshing state... [id=secure.gpo.ca:duplicate]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.question: Refreshing state... [id=secure.gpo.ca:question]
module.default_github_labels_for_readme.github_issue_label.volunteer: Refreshing state... [id=readme:volunteer]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.wontfix: Refreshing state... [id=secure.gpo.ca:wontfix]
module.default_github_labels_for_readme.github_issue_label.wontfix: Refreshing state... [id=readme:wontfix]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.good_first_issue: Refreshing state... [id=secure.gpo.ca:good first issue]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.enhancement: Refreshing state... [id=secure.gpo.ca:enhancement]
module.default_github_labels_for_readme.github_issue_label.bug: Refreshing state... [id=readme:bug]
module.default_github_labels_for_readme.github_issue_label.epic: Refreshing state... [id=readme:Epic]
module.default_github_labels_for_readme.github_issue_label.invalid: Refreshing state... [id=readme:invalid]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.volunteer: Refreshing state... [id=secure.gpo.ca:volunteer]
module.default_github_labels_for_readme.github_issue_label.documentation: Refreshing state... [id=readme:documentation]
module.default_github_labels_for_readme.github_issue_label.help_wanted: Refreshing state... [id=readme:help wanted]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.bug: Refreshing state... [id=secure.gpo.ca:bug]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.invalid: Refreshing state... [id=secure.gpo.ca:invalid]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.epic: Refreshing state... [id=secure.gpo.ca:Epic]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.documentation: Refreshing state... [id=secure.gpo.ca:documentation]
module.default_github_labels_for_secure_gpo_ca.github_issue_label.help_wanted: Refreshing state... [id=secure.gpo.ca:help wanted]
module.default_github_labels_for_gpo_ca.github_issue_label.question: Refreshing state... [id=gpo.ca:question]
module.default_github_labels_for_gpo_ca.github_issue_label.epic: Refreshing state... [id=gpo.ca:Epic]
module.default_github_labels_for_gpo_ca.github_issue_label.volunteer: Refreshing state... [id=gpo.ca:volunteer]
module.default_github_labels_for_gpo_ca.github_issue_label.help_wanted: Refreshing state... [id=gpo.ca:help wanted]
module.default_github_labels_for_gpo_ca.github_issue_label.duplicate: Refreshing state... [id=gpo.ca:duplicate]
module.default_github_labels_for_gpo_ca.github_issue_label.good_first_issue: Refreshing state... [id=gpo.ca:good first issue]
module.default_github_labels_for_gpo_ca.github_issue_label.invalid: Refreshing state... [id=gpo.ca:invalid]
module.default_github_labels_for_gpo_ca.github_issue_label.documentation: Refreshing state... [id=gpo.ca:documentation]
module.default_github_labels_for_gpo_ca.github_issue_label.enhancement: Refreshing state... [id=gpo.ca:enhancement]
module.default_github_labels_for_gpo_ca.github_issue_label.bug: Refreshing state... [id=gpo.ca:bug]
module.default_github_labels_for_gpo_ca.github_issue_label.wontfix: Refreshing state... [id=gpo.ca:wontfix]
github_actions_secret.gpo_ca_SSH_HOST_PROD1: Refreshing state... [id=gpo.ca:SSH_HOST_PROD1]
github_actions_secret.gpo_ca_SSH_HOST_PROD2: Refreshing state... [id=gpo.ca:SSH_HOST_PROD2]
github_actions_secret.gpo_ca_SSH_USER: Refreshing state... [id=gpo.ca:SSH_USER]
github_actions_secret.SSH_HOST_STAGE: Refreshing state... [id=secure.gpo.ca:SSH_HOST_STAGE]
github_actions_secret.SSH_HOST_PROD: Refreshing state... [id=secure.gpo.ca:SSH_HOST_PROD]
github_actions_secret.SSH_PUBLIC_KEY: Refreshing state... [id=secure.gpo.ca:SSH_PUBLIC_KEY]
github_actions_secret.SSH_PRIVATE_KEY: Refreshing state... [id=secure.gpo.ca:SSH_PRIVATE_KEY]
github_actions_secret.gpo_ca_SSH_HOST_STAGE: Refreshing state... [id=gpo.ca:SSH_HOST_STAGE]
github_actions_secret.gpo_ca_SSH_PUBLIC_KEY: Refreshing state... [id=gpo.ca:SSH_PUBLIC_KEY]
github_actions_secret.SSH_USER: Refreshing state... [id=secure.gpo.ca:SSH_USER]
github_actions_secret.gpo_ca_SSH_PRIVATE_KEY: Refreshing state... [id=gpo.ca:SSH_PRIVATE_KEY]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.help_wanted: Refreshing state... [id=gpo-platform-configs:help wanted]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.documentation: Refreshing state... [id=gpo-platform-configs:documentation]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.invalid: Refreshing state... [id=gpo-platform-configs:invalid]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.bug: Refreshing state... [id=gpo-platform-configs:bug]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.epic: Refreshing state... [id=gpo-platform-configs:Epic]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.wontfix: Refreshing state... [id=gpo-platform-configs:wontfix]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.question: Refreshing state... [id=gpo-platform-configs:question]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.volunteer: Refreshing state... [id=gpo-platform-configs:volunteer]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.good_first_issue: Refreshing state... [id=gpo-platform-configs:good first issue]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.duplicate: Refreshing state... [id=gpo-platform-configs:duplicate]
module.default_github_labels_for_gpo_platform_configs.github_issue_label.enhancement: Refreshing state... [id=gpo-platform-configs:enhancement]
aws_s3_bucket_versioning.terraform_state_bucket_versioning: Refreshing state... [id=gpo-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.terraform_state_crypto_conf: Refreshing state... [id=gpo-terraform-state]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

OpenTofu will perform the following actions:

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.custom_labels["CiviCRM"] will be created
  + resource "github_issue_label" "custom_labels" {
      + color      = "0e8a16"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "CiviCRM"
      + repository = "secure.gpo.ca"
      + url        = (known after apply)
    }

  # module.default_github_labels_for_secure_gpo_ca.github_issue_label.custom_labels["Drupal"] will be created
  + resource "github_issue_label" "custom_labels" {
      + color      = "0e8a16"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Drupal"
      + repository = "secure.gpo.ca"
      + url        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

──────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan
```